Repository: VitalyZnachenok/ai-translator
Catalog: AI Translator/Localizable.xcstrings
Source language: ru
Languages: en

source: ↪︎ Перевести на месте (%@)
en: ↪︎ Translate in place (%@)

source: ↪︎ Перевод на месте
en: ↪︎ In-place translation

source: ⚙️ Настройки...
en: ⚙️ Settings...

source: ⚡ Быстрый перевод (в окне)
en: ⚡ Quick translation (in window)

source: ⚡ Перевести выделенный текст (%@)
en: ⚡ Translate selected text (%@)

source: ✅ Запуск при старте системы
en: ✅ Launch at system startup

source: ✅ Подключение успешно! Тестовый перевод: %@
en: ✅ Connection successful! Test translation: %@

source: ❌ Выйти
en: ❌ Quit

source: ❌ Ошибка: %@
en: ❌ Error: %@

source: ⬜ Запуск при старте системы
en: ⬜ Launch at system startup

source: 🌐 Авто
en: 🌐 Auto

source: 🌐 Авто-определение
en: 🌐 Auto-detect

source: 🌐 Открыть переводчик
en: 🌐 Open translator

source: 🌐 Язык интерфейса
en: 🌐 Interface language

source: 🎯 Стандартный
en: 🎯 Standard

source: 📁 Профили подключения
en: 📁 Connection profiles

source: 📋 История переводов
en: 📋 Translation history

source: 📋 Как использовать
en: 📋 How to use

source: 📖 О программе
en: 📖 About

source: 🔗 Активный профиль
en: 🔗 Active profile

source: 🧪 Тестирование
en: 🧪 Testing

source: AI Переводчик
en: AI Translator

source: API endpoint не найден. Проверьте URL.
en: API endpoint not found. Check the URL.

source: gpt-4o-mini или llama3.2:latest
en: gpt-4o-mini or llama3.2:latest

source: HTTP ошибка: %lld. %@
en: HTTP error: %lld. %@

source: ℹ️ Как получить настройки
en: ℹ️ How to get the settings

source: ID модели: %@
en: Model ID: %@

source: URL обычно имеет вид: https://your-domain.com/v1
en: The URL usually looks like: https://your-domain.com/v1

source: Автоматический обмен направлением:
en: Automatic direction swap:

source: Автоматический обмен по определению языка
en: Automatic swap based on language detection

source: Активный профиль:
en: Active profile:

source: Быстрый перевод выделенного текста (в окне):
en: Quick translation of selected text (in window):

source: В
en: To

source: Введите токен
en: Enter token

source: Версия %@ (%@) Умный переводчик с поддержкой OpenWebUI API Возможности: • Перевод между 16 языками • Интеграция с любыми AI моделями • Работа из меню-бара • Быстрый доступ и компактный интерфейс • Кастомные промпты для разных стилей перевода • Быстрый перевод выделенного текста • Перевод выделенного текста "на месте" (с заменой) • Автоматическое копирование и восстановление буфера Горячие клавиши: • Cmd+O - открыть переводчик • Настраиваемая горячая клавиша - перевести выделенный текст в окне • Настраиваемая горячая клавиша - перевести на месте (заменить выделение) • Cmd+, - настройки • Cmd+Q - выход Создано для удобного перевода текстов с помощью ИИ.
en: Version %@ (%@) A smart translator with OpenWebUI API support Features: • Translation between 16 languages • Integration with any AI models • Works from the menu bar • Quick access and a compact interface • Custom prompts for different translation styles • Quick translation of selected text • "In-place" translation of selected text (with replacement) • Automatic clipboard copy and restore Hotkeys: • Cmd+O - open the translator • Customizable hotkey - translate selected text in a window • Customizable hotkey - translate in place (replace the selection) • Cmd+, - settings • Cmd+Q - quit Made for convenient text translation with AI.

source: Включить перевод на месте
en: Enable in-place translation

source: Вставить
en: Paste

source: Вставить из буфера
en: Paste from clipboard

source: Вставить текст из буфера обмена
en: Paste text from the clipboard

source: Выберите модель
en: Select a model

source: Выберите модель...
en: Select a model...

source: Выбор модели
en: Model selection

source: Выбранная модель: %@
en: Selected model: %@

source: Выделенный текст будет заменён переводом прямо на месте
en: The selected text will be replaced with the translation in place

source: Выделите текст в любом приложении
en: Select text in any application

source: Выделите текст для перевода и попробуйте снова
en: Select text to translate and try again

source: Выделите текст для перевода и попробуйте снова.
en: Select text to translate and try again.

source: Горячая клавиша:
en: Hotkey:

source: Горячие клавиши
en: Hotkeys

source: Готов
en: Ready

source: Для изменения настроек используйте редактор профилей выше
en: To change settings, use the profile editor above

source: Для использования глобальных горячих клавиш приложению требуется доступ к универсальному доступу. Пожалуйста, добавьте AI Переводчик в: Системные настройки → Защита и безопасность → Конфиденциальность → Универсальный доступ
en: To use global hotkeys, the app needs Accessibility access. Please add AI Translator to: System Settings → Privacy & Security → Privacy → Accessibility

source: Для получения API ключа:
en: To get an API key:

source: Добавить пару
en: Add pair

source: Добавить примеры
en: Add examples

source: Добавить примеры стилей
en: Add example styles

source: Добавить стиль
en: Add style

source: Добавьте свои стили перевода для разных случаев: простой язык, технический перевод, литературный стиль и т.д.
en: Add your own translation styles for different cases: simple language, technical translation, literary style, and so on.

source: Дополнение к запросу пользователя:
en: Addition to the user request:

source: Доступ запрещен. Проверьте права доступа.
en: Access denied. Check your access permissions.

source: Доступно моделей: %lld
en: Models available: %lld

source: Дублировать
en: Duplicate

source: Загружаем...
en: Loading...

source: Закрыть
en: Close

source: Заменяет выделенный текст переводом прямо в активном окне
en: Replaces the selected text with its translation directly in the active window

source: Заполните URL API и токен для загрузки моделей
en: Fill in the API URL and token to load models

source: Здесь будут сохраняться выполненные переводы
en: Completed translations will be saved here

source: Изменить
en: Change

source: Иконка:
en: Icon:

source: Использовать собственные настройки
en: Use custom settings

source: Используйте модификаторы: ⌘ Command, ⇧ Shift, ⌥ Option, ⌃ Control
en: Use modifiers: ⌘ Command, ⇧ Shift, ⌥ Option, ⌃ Control

source: История переводов
en: Translation history

source: История пуста
en: History is empty

source: Исходный язык
en: Source language

source: Исходный язык:
en: Source language:

source: Конфликт: эта комбинация совпадает с быстрым переводом — приоритет получит перевод на месте.
en: Conflict: this shortcut matches the quick translation — in-place translation will take priority.

source: Копировать
en: Copy

source: Копировать перевод в буфер обмена
en: Copy the translation to the clipboard

source: Краткое описание
en: Short description

source: Модель не выбрана
en: No model selected

source: Модель:
en: Model:

source: Модель: %@
en: Model: %@

source: На какой язык:
en: To language:

source: Нажмите 'Create new API key'
en: Click 'Create new API key'

source: Нажмите 'Обновить' для загрузки списка доступных моделей
en: Click 'Refresh' to load the list of available models

source: Нажмите Cmd+Enter для быстрого перевода
en: Press Cmd+Enter for a quick translation

source: Нажмите горячую клавишу %@
en: Press the hotkey %@

source: Нажмите новую комбинацию...
en: Press a new shortcut...

source: Название стиля
en: Style name

source: Название:
en: Name:

source: Например: 'Основной сервер'
en: For example: 'Main server'

source: Настроен
en: Configured

source: Настройка стилей перевода
en: Translation style settings

source: Настройки
en: Settings

source: Настройки (⌘,)
en: Settings (⌘,)

source: Настройки AI Переводчика
en: AI Translator Settings

source: Настройки не сконфигурированы. Проверьте URL API, токен и модель.
en: Settings are not configured. Check the API URL, token, and model.

source: Настройки подключения
en: Connection settings

source: Настройки промпта
en: Prompt settings

source: Настройте подключение
en: Configure the connection

source: Настройте подключение к API в настройках
en: Configure the API connection in settings

source: Не настроен
en: Not configured

source: Не настроено
en: Not configured

source: Не удалось вставить перевод
en: Failed to paste the translation

source: Неверный API токен.
en: Invalid API token.

source: Неверный URL API. Проверьте настройки.
en: Invalid API URL. Check the settings.

source: Неверный формат ответа от сервера.
en: Invalid response format from the server.

source: Нет выделенного текста
en: No text selected

source: Нет настроенных профилей
en: No configured profiles

source: Нет настроенных стилей
en: No configured styles

source: Нет подключения к интернету. Проверьте сетевые настройки.
en: No internet connection. Check your network settings.

source: Новый профиль
en: New profile

source: Новый профиль подключения
en: New connection profile

source: Новый стиль перевода
en: New translation style

source: Обновить список
en: Refresh list

source: Определяет язык выделенного текста и переводит в обратную сторону пары. Если язык не входит ни в одну активную пару — используются настройки выше.
en: Detects the language of the selected text and translates it to the other side of the pair. If the language isn't part of any active pair, the settings above are used.

source: Основная информация
en: Basic information

source: Основные
en: General

source: От
en: From

source: Откроется окно переводчика с готовым переводом
en: The translator window will open with the translation ready

source: Откройте ваш OpenWebUI
en: Open your OpenWebUI

source: Открыть настройки
en: Open settings

source: Открыть окно переводчика и сразу перевести выделенный текст
en: Open the translator window and immediately translate the selected text

source: Открыть полную версию (⌘O)
en: Open the full version (⌘O)

source: Отмена
en: Cancel

source: Очистить
en: Clear

source: Очистить ввод и результат
en: Clear input and result

source: Очистить всё
en: Clear all

source: Очистить кэш
en: Clear cache

source: Очистить кэш моделей и загрузить заново
en: Clear the models cache and reload

source: Очистить результат
en: Clear result

source: Очистить текст
en: Clear text

source: Ошибка
en: Error

source: Ошибка API: %@
en: API error: %@

source: Ошибка загрузки: %@
en: Loading error: %@

source: Ошибка перевода
en: Translation error

source: Ошибка сервера. Попробуйте позже.
en: Server error. Try again later.

source: Ошибка сети. Проверьте интернет соединение и попробуйте снова.
en: Network error. Check your internet connection and try again.

source: Ошибка формирования запроса.
en: Failed to build the request.

source: Параметры генерации
en: Generation parameters

source: Параметры генерации:
en: Generation parameters:

source: Перевести
en: Translate

source: Перевести с комментариями и объяснениями выбора слов
en: Translate with comments and explanations of word choices

source: Перевести с пояснениями
en: Translate with explanations

source: Перевести текст (⌘↩)
en: Translate text (⌘↩)

source: Перевод на месте (с заменой текста):
en: In-place translation (with text replacement):

source: Перевод на месте использует язык и стиль, выбранные в окне переводчика
en: In-place translation uses the language and style selected in the translator window

source: Перевод на месте использует язык и стиль, заданные ниже
en: In-place translation uses the language and style set below

source: Перевод не настроен
en: Translation not configured

source: Перевод скопирован в буфер обмена — попробуйте вставить вручную (⌘V).
en: The translation was copied to the clipboard — try pasting it manually (⌘V).

source: Переводим...
en: Translating...

source: Перезапустить сейчас
en: Restart now

source: Перейдите в Settings → Account → API Keys
en: Go to Settings → Account → API Keys

source: Переключить профиль
en: Switch profile

source: Переключить профиль подключения
en: Switch connection profile

source: По умолчанию
en: Default

source: Повторное нажатие %@ во время перевода отменяет операцию
en: Pressing %@ again during translation cancels the operation

source: Подключение
en: Connection

source: Подключено
en: Connected

source: Позже
en: Later

source: Поиск по тексту…
en: Search by text…

source: Поменять языки местами
en: Swap languages

source: Превышено время ожидания ответа. Проверьте соединение и попробуйте снова.
en: The response timed out. Check your connection and try again.

source: Приложение автоматически восстанавливает предыдущее содержимое буфера обмена
en: The app automatically restores the previous clipboard contents

source: Приложение само определит язык выделенного текста и переведёт его в обратную сторону пары — например, русский ↔ английский. Если язык не входит ни в одну активную пару, используется обычное направление перевода.
en: The app will detect the language of the selected text and translate it to the other side of the pair — for example, Russian ↔ English. If the language isn't part of any active pair, the usual translation direction is used.

source: Примеры URL:
en: URL examples:

source: Провайдер: %@
en: Provider: %@

source: Проверьте настройки API.
en: Check the API settings.

source: Профиль не выбран
en: No profile selected

source: Редактировать
en: Edit

source: Редактировать профиль
en: Edit profile

source: Редактировать стиль
en: Edit style

source: Результат перевода появится здесь...
en: The translation result will appear here...

source: Результат перевода:
en: Translation result:

source: Результат:
en: Result:

source: Русский
en: Russian

source: Ручной ввод
en: Manual input

source: С какого языка:
en: From language:

source: С пояснениями
en: With explanations

source: Сбросить на значение по умолчанию (⌘⇧T)
en: Reset to the default (⌘⇧T)

source: Системный
en: System

source: Системный — использовать язык macOS (если он не поддерживается, интерфейс будет на английском). Изменение применяется после перезапуска.
en: System — use the macOS language (if it is not supported, the interface will be in English). The change takes effect after a restart.

source: Системный промпт:
en: System prompt:

source: Скопировано!
en: Copied!

source: Скопировать перевод
en: Copy translation

source: Скопируйте созданный ключ
en: Copy the created key

source: Слишком много запросов. Попробуйте позже.
en: Too many requests. Try again later.

source: Сначала настройте профиль подключения в окне настроек.
en: First, set up a connection profile in the settings window.

source: Создайте или выберите профиль для тестирования
en: Create or select a profile to test

source: Создайте или выберите профиль подключения выше
en: Create or select a connection profile above

source: Создать первый профиль
en: Create your first profile

source: Сохранить
en: Save

source: Список пар пуст — добавьте хотя бы одну, чтобы автообмен заработал.
en: The pair list is empty — add at least one to enable auto-swap.

source: Стили перевода
en: Translation styles

source: Стиль
en: Style

source: Стиль перевода:
en: Translation style:

source: Текст для перевода:
en: Text to translate:

source: Текст:
en: Text:

source: Текущая комбинация:
en: Current shortcut:

source: Тест активного профиля
en: Test active profile

source: Тест подключения
en: Test connection

source: Тестирование
en: Testing

source: Тестируем подключение...
en: Testing connection...

source: Тестируем...
en: Testing...

source: Требуется разрешение
en: Permission required

source: Удалить
en: Delete

source: Удалить запись
en: Delete entry

source: Удалить пару
en: Delete pair

source: Целевой язык
en: Target language

source: Целевой язык:
en: Target language:

source: Чтобы применить новый язык, нужно перезапустить приложение.
en: Restart the app to apply the new language.

source: Язык интерфейса
en: Interface language

source: Язык интерфейса изменён
en: Interface language changed

source: Языковые пары
en: Language pairs
